In [1]:
path = "../data/"

In [2]:
import pandas as pd

df = pd.read_csv(path+"penguins.csv" )

In [3]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

# Indexing a Dataframe using indexing operator `[]`

In order to select a single column, we simply put the name of the column in-between the brackets

In [4]:
df['bill_length_mm']

0      39.1
1      39.5
2      40.3
3       NaN
4      36.7
       ...
339     NaN
340    46.8
341    50.4
342    45.2
343    49.9
Name: bill_length_mm, Length: 344, dtype: float64

In [5]:
type(df['bill_length_mm'])

pandas.core.series.Series

use dot notation(attribute operator . )

In [6]:
df.bill_length_mm

0      39.1
1      39.5
2      40.3
3       NaN
4      36.7
       ...
339     NaN
340    46.8
341    50.4
342    45.2
343    49.9
Name: bill_length_mm, Length: 344, dtype: float64

In [7]:
type(df.bill_length_mm)

pandas.core.series.Series

In [8]:
df['min'] = 0

In [9]:
df.head(1)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,min
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE,0

In [10]:
df['min']

0      0
1      0
2      0
3      0
4      0
      ..
339    0
340    0
341    0
342    0
343    0
Name: min, Length: 344, dtype: int64

In [11]:
df.min

<bound method NDFrame._add_numeric_operations.<locals>.min of     species     island  bill_length_mm  bill_depth_mm  flipper_length_mm  \
0    Adelie  Torgersen            39.1           18.7              181.0
1    Adelie  Torgersen            39.5           17.4              186.0
2    Adelie  Torgersen            40.3           18.0              195.0
3    Adelie  Torgersen             NaN            NaN                NaN
4    Adelie  Torgersen            36.7           19.3              193.0
..      ...        ...             ...            ...                ...
339  Gentoo     Biscoe             NaN            NaN                NaN
340  Gentoo     Biscoe            46.8           14.3              215.0
341  Gentoo     Biscoe            50.4           15.7              222.0
342  Gentoo     Biscoe            45.2           14.8              212.0
343  Gentoo     Biscoe            49.9           16.1              213.0

     body_mass_g     sex  min
0         3750.0    MALE    0
1         3800.0  FEMALE    0
2         3250.0  FEMALE    0
3            NaN     NaN    0
4         3450.0  FEMALE    0
..           ...     ...  ...
339          NaN     NaN    0
340       4850.0  FEMALE    0
341       5750.0    MALE    0
342       5200.0  FEMALE    0
343       5400.0    MALE    0

[344 rows x 8 columns]>

In [12]:
df.rename(columns={'min':'index'}, inplace=True)

In [13]:
df.head(1)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,index
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE,0

In [14]:
df.index

RangeIndex(start=0, stop=344, step=1)

In [15]:
df['index']

0      0
1      0
2      0
3      0
4      0
      ..
339    0
340    0
341    0
342    0
343    0
Name: index, Length: 344, dtype: int64

# Label-based selection

In [16]:
fruit_data = {
  "Name": ["Apple", "Orange", "Grape", "Strawberry"],
  "Color": ["Red/Green", "Orange", "Purple", "Red"]
}

df1 = pd.DataFrame(fruit_data, index= ["a", "b", "c", "d"])
df1

         Name      Color
a       Apple  Red/Green
b      Orange     Orange
c       Grape     Purple
d  Strawberry        Red

In [17]:
df2 = pd.DataFrame(fruit_data)
df2

         Name      Color
0       Apple  Red/Green
1      Orange     Orange
2       Grape     Purple
3  Strawberry        Red

In [18]:
df1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [19]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df1.loc['a']

Name         Apple
Color    Red/Green
Name: a, dtype: object

In [21]:
try:
    df1.loc['x']
except Exception as e:
    print("An error occurred:", type(e).__name__, "–", e)

An error occurred: KeyError – 'x'

###### Select the first row

In [22]:
try:
    df1.loc[a]
except Exception as e:
       print("An error occurred:", type(e).__name__, "–", e)

An error occurred: NameError – name 'a' is not defined

In [23]:
df1.loc['a']

Name         Apple
Color    Red/Green
Name: a, dtype: object

In [24]:
df2.loc[0]

Name         Apple
Color    Red/Green
Name: 0, dtype: object

In [25]:
type(df2.loc[0])

pandas.core.series.Series

In [26]:
df2.loc[0].index

Index(['Name', 'Color'], dtype='object')

###### Select multiple rows
In order to select multiple rows, we put all the row labels in a list and pass that to `.loc` function.

In [27]:
df1.loc[['a','c']]

    Name      Color
a  Apple  Red/Green
c  Grape     Purple

In [28]:
df2.loc[[0,2]]

    Name      Color
0  Apple  Red/Green
2  Grape     Purple

In [29]:
type(df2.loc[[0,2]])

pandas.core.frame.DataFrame

###### Get the first entry in column ‘Name’

In [30]:
df1.loc['a','Name']

'Apple'

In [31]:
df2.loc[0,'Name']

'Apple'

###### Select multiple rows and columns

In [32]:
df1.loc[['a','b'],['Name','Color']]

     Name      Color
a   Apple  Red/Green
b  Orange     Orange

In [33]:
df2.loc[[0,1],['Name','Color']]

     Name      Color
0   Apple  Red/Green
1  Orange     Orange

###### Selecting all of the rows and some columns

In [34]:
df1.loc[:,['Name']]

         Name
a       Apple
b      Orange
c       Grape
d  Strawberry

In [35]:
df2.loc[:,['Name','Color']]

         Name      Color
0       Apple  Red/Green
1      Orange     Orange
2       Grape     Purple
3  Strawberry        Red

In [36]:
df1.loc[['a','b'],:]

     Name      Color
a   Apple  Red/Green
b  Orange     Orange

In [37]:
df2.loc[[0,1],:]

     Name      Color
0   Apple  Red/Green
1  Orange     Orange

In [38]:
df2.loc[:,:]

         Name      Color
0       Apple  Red/Green
1      Orange     Orange
2       Grape     Purple
3  Strawberry        Red

###### use slice

In [39]:
df1.loc['a':'c',:]

     Name      Color
a   Apple  Red/Green
b  Orange     Orange
c   Grape     Purple

In [40]:
df2.loc[0:2,:]

     Name      Color
0   Apple  Red/Green
1  Orange     Orange
2   Grape     Purple

###### Boolean series/array

In [41]:
df1

         Name      Color
a       Apple  Red/Green
b      Orange     Orange
c       Grape     Purple
d  Strawberry        Red

In [42]:
df1.Color.str.contains('Red')

a     True
b    False
c    False
d     True
Name: Color, dtype: bool

In [43]:
type(df1.Color.str.contains('Red'))

pandas.core.series.Series

In [44]:
df1.loc[df1.Color.str.contains('Red')]

         Name      Color
a       Apple  Red/Green
d  Strawberry        Red

In [45]:
df1.Color.str.contains('Red')

a     True
b    False
c    False
d     True
Name: Color, dtype: bool

# Integer position based selection

In [46]:
df1.iloc[0]

Name         Apple
Color    Red/Green
Name: a, dtype: object

In [47]:
df2.iloc[0]

Name         Apple
Color    Red/Green
Name: 0, dtype: object

In [48]:
type(df2.iloc[0])

pandas.core.series.Series

In [49]:
try:
    df1.iloc[5]
except Exception as e:
       print("An error occurred:", type(e).__name__, "–", e)

An error occurred: IndexError – single positional indexer is out-of-bounds

In [50]:
df1.iloc[:,0]

a         Apple
b        Orange
c         Grape
d    Strawberry
Name: Name, dtype: object

In [51]:
df2.iloc[:,0]

0         Apple
1        Orange
2         Grape
3    Strawberry
Name: Name, dtype: object

In [52]:
type(df2.iloc[:,0])

pandas.core.series.Series

In [53]:
df1.iloc[1:3]

     Name   Color
b  Orange  Orange
c   Grape  Purple

In [54]:
df1.iloc[[0,1,3],0]

a         Apple
b        Orange
d    Strawberry
Name: Name, dtype: object

In [55]:
df1.iloc[[0,1,3],0:2]

         Name      Color
a       Apple  Red/Green
b      Orange     Orange
d  Strawberry        Red

In [56]:
df1.iloc[[-1],:]

         Name Color
d  Strawberry   Red

In [57]:
df1.iloc[-1,-1]

'Red'

In [58]:
df1.Color.str.contains('Red')

a     True
b    False
c    False
d     True
Name: Color, dtype: bool

In [59]:
try:
    df1.iloc[df1.Color.str.contains('Red')]
except Exception as e:
       print("An error occurred:", type(e).__name__, "–", e)

An error occurred: ValueError – iLocation based boolean indexing cannot use an indexable as a mask

In [60]:
import numpy as np
bool_array = np.array(df1.Color.str.contains('Red'))
bool_array

array([ True, False, False,  True])

In [61]:
df1.iloc[bool_array]

         Name      Color
a       Apple  Red/Green
d  Strawberry        Red

###### Find the label of position index

In [62]:
df1

         Name      Color
a       Apple  Red/Green
b      Orange     Orange
c       Grape     Purple
d  Strawberry        Red

In [63]:
df1.index[[0, 2]]

Index(['a', 'c'], dtype='object')

In [64]:
df2.index[[0, 2]]

Index([0, 2], dtype='int64')

In [65]:
df1.loc[df1.index[[0, 2]],'Name']

a    Apple
c    Grape
Name: Name, dtype: object

In [66]:
 df1.columns.get_loc('Name')

0

In [67]:
 df1.columns.get_loc('Color')

1

In [68]:
 df1.index.get_loc('b')

1

In [69]:
 df1.index.get_loc('d')

3

In [70]:
df1.iloc[df1.index.get_loc('d'), [0,1]]

Name     Strawberry
Color           Red
Name: d, dtype: object

In [71]:
df1.iloc[[0,1], df1.columns.get_loc('Color')]

a    Red/Green
b       Orange
Name: Color, dtype: object

###### callable

In [72]:
import pandas as pd

penguin_data = {
    'Species': ['Adelie', 'Adelie', 'Chinstrap', 'Chinstrap', 'Gentoo', 'Gentoo'],
    'Weight_kg': [3, 4, 7, 6, 10, 9],
    'Location': ['Antarctica', 'Antarctica', 'Antarctica', 'Antarctica', 'Antarctica', 'Antarctica']
}
penguins = pd.DataFrame(penguin_data)
penguins

     Species  Weight_kg    Location
0     Adelie          3  Antarctica
1     Adelie          4  Antarctica
2  Chinstrap          7  Antarctica
3  Chinstrap          6  Antarctica
4     Gentoo         10  Antarctica
5     Gentoo          9  Antarctica

In [73]:
def filter_species(species, data):
    return data['Species'] == species

In [74]:
filtered_penguins = penguins[filter_species('Chinstrap', penguins)]

In [75]:
filtered_penguins

     Species  Weight_kg    Location
2  Chinstrap          7  Antarctica
3  Chinstrap          6  Antarctica

In [76]:
penguins

     Species  Weight_kg    Location
0     Adelie          3  Antarctica
1     Adelie          4  Antarctica
2  Chinstrap          7  Antarctica
3  Chinstrap          6  Antarctica
4     Gentoo         10  Antarctica
5     Gentoo          9  Antarctica

In [77]:
penguins.loc[lambda penguins: penguins['Weight_kg'] >= 7, :]

     Species  Weight_kg    Location
2  Chinstrap          7  Antarctica
4     Gentoo         10  Antarctica
5     Gentoo          9  Antarctica

# Set / reset index

In [78]:
import pandas as pd

data = {
    'fruits': ['Apple', 'Orange', 'Banana', 'Watermelon', 'Strawberry'],
    'color': ['red', 'orange', 'yellow', 'green', 'red'],
    'flavor': ['sweet', 'tart', 'mild', 'juicy', 'sweet'],
}

df =  pd.DataFrame(data, index=data['fruits'], columns=['color', 'flavor'])
df

             color flavor
Apple          red  sweet
Orange      orange   tart
Banana      yellow   mild
Watermelon   green  juicy
Strawberry     red  sweet

In [79]:
import pandas as pd

data = {
    'fruits': ['Apple', 'Orange', 'Banana', 'Watermelon', 'Strawberry'],
    'color': ['red', 'orange', 'yellow', 'green', 'red'],
    'flavor': ['sweet', 'tart', 'mild', 'juicy', 'sweet'],
}

df =  pd.DataFrame(data)
df

       fruits   color flavor
0       Apple     red  sweet
1      Orange  orange   tart
2      Banana  yellow   mild
3  Watermelon   green  juicy
4  Strawberry     red  sweet

In [80]:
df.set_index('fruits', inplace=True)

In [81]:
df

             color flavor
fruits
Apple          red  sweet
Orange      orange   tart
Banana      yellow   mild
Watermelon   green  juicy
Strawberry     red  sweet

In [82]:
df.index

Index(['Apple', 'Orange', 'Banana', 'Watermelon', 'Strawberry'], dtype='object', name='fruits')

In [83]:
type(df.index)

pandas.core.indexes.base.Index

In [84]:
# Meaningful and informative index
fruits_df = pd.DataFrame({
    'weight': {
        'apple': 100,
        'banana': 150,
        'kiwi': 80
    },
    'color': {
        'apple': 'red',
        'banana': 'yellow',
        'kiwi': 'green'
    },
    'taste': {
        'apple': 'sweet',
        'banana': 'mild',
        'kiwi': 'tangy'
    }
},
index=['apple', 'banana', 'kiwi'])

# Bad example of indexing
fruits_df_bad = pd.DataFrame({
    'weight': {
        'a': 100,
        'b': 150,
        'c': 80
    },
    'color': {
        'a': 'red',
        'b': 'yellow',
        'c': 'green'
    },
    'taste': {
        'a': 'sweet',
        'b': 'mild',
        'c': 'tangy'
    }
},
index=['a', 'b', 'c'])

In [85]:
fruits_df

        weight   color  taste
apple      100     red  sweet
banana     150  yellow   mild
kiwi        80   green  tangy

In [86]:
fruits_df_bad

   weight   color  taste
a     100     red  sweet
b     150  yellow   mild
c      80   green  tangy

###### Reset the index

In [87]:
# Unique and consistent index based on 'employee_id'
employees_df = pd.DataFrame({
    'first_name': {
        101: 'Joe',
        102: 'Sarah',
        103: 'Tim',
        104: 'Jessica',
        105: 'Lisa'
    },
    'last_name': {
        101: 'Smith',
        102: 'Johnson',
        103: 'Adams',
        104: 'Brown',
        105: 'Johnson'
    },
    'salary': {
        101: 50000,
        102: 45000,
        103: 60000,
        104: 35000,
        105: 50000
    },
    'department': {
        101: 'Finance',
        102: 'Marketing',
        103: 'IT',
        104: 'HR',
        105: 'Sales'
    }
},
index=[101, 102, 103, 104, 105])

In [88]:
employees_df.index.name = 'employee_id'

In [89]:
employees_df

            first_name last_name  salary department
employee_id
101                Joe     Smith   50000    Finance
102              Sarah   Johnson   45000  Marketing
103                Tim     Adams   60000         IT
104            Jessica     Brown   35000         HR
105               Lisa   Johnson   50000      Sales

In [90]:
employees_df.index

Index([101, 102, 103, 104, 105], dtype='int64', name='employee_id')

In [91]:
employees_df.reset_index(inplace=True)

In [92]:
employees_df

   employee_id first_name last_name  salary department
0          101        Joe     Smith   50000    Finance
1          102      Sarah   Johnson   45000  Marketing
2          103        Tim     Adams   60000         IT
3          104    Jessica     Brown   35000         HR
4          105       Lisa   Johnson   50000      Sales

In [93]:
employees_df.index

RangeIndex(start=0, stop=5, step=1)

# Multi-index

In [94]:
import pandas as pd
import numpy as np

# Generate sample data
years = [2019, 2019, 2019, 2019, 2020, 2020, 2020, 2020, 2021, 2021, 2021, 2021]
regions = ['North','North', 'South', 'South', 'North','North', 'South', 'South', 
           'North','North', 'South', 'South']
fruits = ['Apple', 'Banana', 'Apple', 'Banana', 'Apple', 'Banana',
          'Apple', 'Banana', 'Apple', 'Banana', 'Apple', 'Banana']
prices = np.random.randint(1, 10, size=12)
amounts = np.random.randint(50, 200, size=12)

# Create a MultiIndex using tuples
index = pd.MultiIndex.from_tuples(zip(years, regions, fruits), names=['Year', 'Region', 'Fruit'])

# Create a DataFrame
data = {'Price': prices, 'Amount': amounts}
df = pd.DataFrame(data, index=index)

# Display the MultiIndex DataFrame
df

                    Price  Amount
Year Region Fruit
2019 North  Apple       9     178
            Banana      6      95
     South  Apple       7     192
            Banana      1     100
2020 North  Apple       2      67
            Banana      6     112
     South  Apple       5      92
            Banana      1     128
2021 North  Apple       2     167
            Banana      2     190
     South  Apple       5     104
            Banana      2      55

You can use loc, as a general purpose solution applicable to most situations:

In [95]:
df.index

MultiIndex([(2019, 'North',  'Apple'),
            (2019, 'North', 'Banana'),
            (2019, 'South',  'Apple'),
            (2019, 'South', 'Banana'),
            (2020, 'North',  'Apple'),
            (2020, 'North', 'Banana'),
            (2020, 'South',  'Apple'),
            (2020, 'South', 'Banana'),
            (2021, 'North',  'Apple'),
            (2021, 'North', 'Banana'),
            (2021, 'South',  'Apple'),
            (2021, 'South', 'Banana')],
           names=['Year', 'Region', 'Fruit'])

In [96]:
df.loc[[2019]]

                    Price  Amount
Year Region Fruit
2019 North  Apple       9     178
            Banana      6      95
     South  Apple       7     192
            Banana      1     100

In [97]:
df.loc[[2019,2020]]

                    Price  Amount
Year Region Fruit
2019 North  Apple       9     178
            Banana      6      95
     South  Apple       7     192
            Banana      1     100
2020 North  Apple       2      67
            Banana      6     112
     South  Apple       5      92
            Banana      1     128

In [98]:
df.loc[([2019,2020])]

                    Price  Amount
Year Region Fruit
2019 North  Apple       9     178
            Banana      6      95
     South  Apple       7     192
            Banana      1     100
2020 North  Apple       2      67
            Banana      6     112
     South  Apple       5      92
            Banana      1     128

In [99]:
df.loc[(2019):(2020)]

                    Price  Amount
Year Region Fruit
2019 North  Apple       9     178
            Banana      6      95
     South  Apple       7     192
            Banana      1     100
2020 North  Apple       2      67
            Banana      6     112
     South  Apple       5      92
            Banana      1     128

In [100]:
df.loc[(2019,'North')]

        Price  Amount
Fruit
Apple       9     178
Banana      6      95

In [101]:
df.loc[(2019,'North','Apple')]

Price       9
Amount    178
Name: (2019, North, Apple), dtype: int32

In [102]:
df.loc[[(2019,'North','Apple'),(2020,'North','Apple')]]

                   Price  Amount
Year Region Fruit
2019 North  Apple      9     178
2020 North  Apple      2      67

In [103]:
df.loc[(2019,'North','Apple'),'Price']

9

In [104]:
idx = pd.IndexSlice

In [105]:
df.loc[idx[:,:,'Apple'],:]

                   Price  Amount
Year Region Fruit
2019 North  Apple      9     178
     South  Apple      7     192
2020 North  Apple      2      67
     South  Apple      5      92
2021 North  Apple      2     167
     South  Apple      5     104

In [106]:
import pandas as pd
idx = pd.IndexSlice
print(idx[0])                
print(idx[0,'a'])           
print(idx[0:10])  
print(idx[0:10:2])  
print(idx[:])  
print(idx[:,'North']) 
print(idx[:,:,'Apple'])

0
(0, 'a')
slice(0, 10, None)
slice(0, 10, 2)
slice(None, None, None)
(slice(None, None, None), 'North')
(slice(None, None, None), slice(None, None, None), 'Apple')

In [107]:
df.loc[idx[[2019,2020],:,'Apple'],:]

                   Price  Amount
Year Region Fruit
2019 North  Apple      9     178
     South  Apple      7     192
2020 North  Apple      2      67
     South  Apple      5      92

In [108]:
df.index.get_level_values(0)

Index([2019, 2019, 2019, 2019, 2020, 2020, 2020, 2020, 2021, 2021, 2021, 2021], dtype='int64', name='Year')

In [109]:
df.index.get_level_values(1)

Index(['North', 'North', 'South', 'South', 'North', 'North', 'South', 'South',
       'North', 'North', 'South', 'South'],
      dtype='object', name='Region')

In [110]:
df.index.get_level_values(2)

Index(['Apple', 'Banana', 'Apple', 'Banana', 'Apple', 'Banana', 'Apple',
       'Banana', 'Apple', 'Banana', 'Apple', 'Banana'],
      dtype='object', name='Fruit')

In [111]:
df.xs("North", level=1)

             Price  Amount
Year Fruit
2019 Apple       9     178
     Banana      6      95
2020 Apple       2      67
     Banana      6     112
2021 Apple       2     167
     Banana      2     190

In [112]:
df.xs("Apple", level=2)

             Price  Amount
Year Region
2019 North       9     178
     South       7     192
2020 North       2      67
     South       5      92
2021 North       2     167
     South       5     104

In [113]:
iterables = [["bar", "baz", "foo", "qux"], ["one", "two"]]

pd.MultiIndex.from_product(iterables, names=["first", "second"])

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])